1. Так як ми маємо масив з об'єктами, то я би перетоворила їх на масиви за значенням.
2. Далі відсортувала масиви за зростанням по першому значенню 
3. Потім треба порівняти масиви за принципом: останнє число попереднього масиву з першим числом наступного, якщо воно менше за попереднє, 
   то треба "об'єднати" інтервал за принципом найменше число з двох масивів та найбільше 
   Якщо інтервал об'єднався, то він буде порівнюватись з наступним. Якщо ж інтервали не перетинаються, то попередній зберігається, а наступний
   знову порівнюється з наступним. Цей цикл буде продовжуватись, поки не буде порівняно останній інтервал часу. 
   Після цього у нас буде новий масив з об'єднаними інтервалами часу.
4. Далі знайдемо різницу між останнім та першим числом в кожному з цих інтервалів. Та отримаємо новий масив з number.
5. Тепер знайдемо суму цих чисел. Та знаючи що кожна 1, дорівнює 30 хв часу, помножимо сумму на 30. Таким чином отримаємо задіяний
   час співробітника у хвилинах.
6. За бажанням можна знайти задіяній час у годинах і хвилинах поділивши отриманий час на 60 та округлити до меншого значення і решту хвилин
   використавши остачу від ділення на 60. 